app/controllers/posts_controller.rb

    def index
        @posts = Post.all
        @posts = @posts.paginate(page: params[:page], per_page: 3)
---
SELECT "posts".* FROM "posts"
SELECT "posts".* FROM "posts" LIMIT ? OFFSET ?  [["LIMIT", 3], ["OFFSET", 0]]

    def show
        #gets an individual post
        @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]