app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."username" IS NULL LIMIT ?  [["LIMIT", 1]]
---
    def index
        # search by User or Keyword, according to which checkbox is checked.
        if params[:search] || params[:username]
            if params[:search]
                @posts = Post.search_by_keyword(params[:search])
            else
                @posts = Post.search_by_user(params[:username])
                @list_posts_by_user = params[:username]
            end
            if (!@posts.nil?)
                @search_success = 1
            else
                # @posts = Post.all
                flash[:notice] = "No matching post!"
                redirect_to controller: 'posts', action: 'index'
                return
            end
        else
            @posts = Post.all