app/controllers/users_controller.rb

    def show
        #shows information on a particular user

        begin
            #@user = User.find(params[:id])
            if params[:id].nil?
                @user=User.find(1)
            else
                @user=User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

    def edit
        #allows for editing a particular user
        @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

    def show
        #shows information on a particular user
        if session[:user_id].nil?
            redirect_to(root_url, :notice => 'Not logged in. Cannot show your account.')
        end

        # begin
        #     @user = User.find(session[:user_id])
        # rescue
        #     redirect_to(root_url, :notice => 'Not logged in. Cannot show your account.')
        # end
        puts "here"
        puts params[:id]
        if User.find_by_username(params[:id]).nil?
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "user1"], ["LIMIT", 1]]