app/controllers/users_controller.rb

        def set_user
            #sets which user is currently logged in
            begin
                @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]